ALTER TABLE PERSON ALTER COLUMN EMAIL NVARCHAR(255) NOT NULL

 update hibernate_sequence
 set next_val= 10

INSERT INTO ALLERGIES VALUES
  (1, 'არაფერი განსაკუთრებული', 'გამონაყარი', 'სტანდარტი1'),
  (2, 'არაფერი განსაკუთრებული', 'ალერგია2', 'სტანდარტი2'),
  (3, 'არაფერი განსაკუთრებული', 'ალერგია3', 'სტანდარტი3'),
  (4, 'არაფერი განსაკუთრებული', 'ალერგია4', 'სტანდარტი4'),
  (5, 'არაფერი განსაკუთრებული', 'ალერგია5', 'სტანდარტი5')


INSERT INTO SURGERIES VALUES 
	(1, 'ბრმა ნაწლავის ოპერაცია'),
	(2, 'გულის ოპერაცია'),
	(3, 'ცხვირის ოპერაცია'),
	(4, 'ყელის ოპერაცია'),
	(5, 'თვალის ოპერაცია')


INSERT INTO DISEASES VALUES
  (1, 1, 'არაფერი განსაკუთრებული', 1, 1, 0, 0, 'ანგინა','სტანდარტი1'),
  (2, 2, 'არაფერი განსაკუთრებული', 2, 1, 1, 0, 'გრიპი','სტანდარტი2'),
  (3, 2, 'არაფერი განსაკუთრებული', 3, 0, 1, 0, 'ხველება','სტანდარტი3'),
  (4, 3, 'არაფერი განსაკუთრებული', 3, 1, 0, 1, 'ბრონქიტი','სტანდარტი4'),
  (5, 4, 'არაფერი განსაკუთრებული', 4, 1, 1, 1, 'სიცხე','სტანდარტი5')
  

INSERT INTO INSURANCE_COMPANY VALUES 
	(1, 'ალდაგი'),
	(2, 'IC Group'),
	(3, 'არდი'),
	(4, 'იარო'),
	(5, 'ჯი პი აი ჰოლდინგი')


INSERT INTO PERSON VALUES
('Doctor', 1, '1992-02-02 19:00:00.000', 2, null, 'sa', 'თამაზ', 'ვაკო', 1, null, 'ბერიძე', 'single', '555330455', '47001028675', 'პროგრამისტი', 1, 1, 'არ აქვს', 'sa', null ),
('Person', 2, '1992-02-01 19:00:00.000', 2, null, 'vako@gmail.com', 'თამაზ', 'ვაკო', 1, null, 'ბერიძე', 'single', '555330455', '47001028675', 'პროგრამისტი', 1, 1, 'არ აქვს', null, null ),
('Doctor', 3, '1992-03-02 19:00:00.000', 2, null, 'vako.beridze@gmail.com', 'tamaz', 'vako', 1, null, 'beridze', 'single', '555330455', '47001028675', 'programmer', 1, 1, 'no', 'medcard', null )
